app/controllers/users_controller.rb

  def index
    # ここで、paginateメソッドを使用しているためviewsでは引数を指定する必要はない
    @users = User.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "email", "picture", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "large_scale_baggage" = ?, "heavy_weight_baggage" = ?, "precision_machine_baggage" = ?, "dont_reverse_baggage" = ?, "broken_article" = ?, "refrigerated_baggage" = ?, "feezed_baggage" = ?, "updated_at" = ? WHERE "users"."id" = ?

  def destroy
    User.find(params[:id]).destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 950961012], ["LIMIT", 1]]